#!/usr/bin/bash

# Θέτω ένα σύμβολο του κώδικα Μορς για κάθε χαρακτήρα
declare -A text_to_morse=(
    ['A']='.-'    ['B']='-...'  ['C']='-.-.'  ['D']='-..'
    ['E']='.'     ['F']='..-.'  ['G']='--.'   ['H']='....'
    ['I']='..'    ['J']='.---'  ['K']='-.-'   ['L']='.-..'
    ['M']='--'    ['N']='-.'    ['O']='---'   ['P']='.--.'
    ['Q']='--.-'  ['R']='.-.'   ['S']='...'   ['T']='-'
    ['U']='..-'   ['V']='...-'  ['W']='.--'   ['X']='-..-'
    ['Y']='-.--'  ['Z']='--..'  [' ']='\t'   # Απο υπόθεση : το κενό αναπαρίσταται με τον ειδικό χαρακτήρα “\t”
)

# Συνάρτηση για την κωδικοποίηση κειμένου σε κώδικα Μορς
encode() {
    local file=$1
    local encodedText=""

    # Διαβάζουμε κάθε γραμμής από το αρχείο
    while IFS= read -r line; do
        # Μετατρέπουμε της γραμμής σε κεφαλαία γράμματα
        line=$(echo "$line" | tr 'a-z' 'A-Z')

        # Κωδικοποιούμε κάθε χαρακτήρα της γραμμής
        for (( i=0; i<${#line}; i++ )); do
            char="${line:$i:1}"
            # Προσθέτουμε κώδικα Μορς για το χαρακτήρα, και κενό ως διαχωριστικό
            if [[ $char == ' ' ]]; then
                encodedText+='\t' # Απο υπόθεση : το κενό αναπαρίσταται με τον ειδικό χαρακτήρα “\t”
            else
                encodedText+="${text_to_morse[$char]} "
            fi
        done
        encodedText+='\n' # Νέα γραμμή για την επόμενη γραμμή κειμένου
    done < "$file"

    # Τυπώνουμε του κωδικοποιημένου κειμένου
    echo -e "$encodedText"
}

# Αντιστοιχίζουμε τα σύμβολο κώδικα Μορς σε χαρακτήρες
declare -A morse_to_text=(
    ['.-']='A'    ['-...']='B'   ['-.-.']='C'   ['-..']='D'
    ['.']='E'     ['..-.']='F'   ['--.']='G'   ['....']='H'
    ['..']='I'    ['.---']='J'   ['-.-']='K'   ['.-..']='L'
    ['--']='M'    ['-.']='N'     ['---']='O'   ['.--.']='P'
    ['--.-']='Q'  ['.-.']='R'    ['...']='S'   ['-']='T'
    ['..-']='U'   ['...-']='V'   ['.--']='W'   ['-..-']='X'
    ['-.--']='Y'  ['--..']='Z'   ['-----']='0' ['.----']='1'
    ['..---']='2' ['...--']='3'  ['....-']='4' ['.....']='5'
    ['-....']='6' ['--...']='7'  ['---..']='8' ['----.']='9'
    ['\t']=' '   # Από υπόθεση : το κενό αναπαρίσταται με τον ειδικό χαρακτήρα “\t”
)

# Συνάρτηση για την αποκωδικοποίηση κώδικα Μορς
decode() {
    local file=$1
    local decodedText=""

    # Διαβάζουμε κάθε γραμμής από το αρχείο
    while IFS= read -r line; do
        # Αποκωδικοποίηση κάθε κώδικα της γραμμής
        for code in ${line// / }; do
            decodedText+="${morse_to_text[$code]}"
        done
        decodedText+='\n' # Νέα γραμμή για την επόμενη γραμμή κειμένου
    done < "$file"

    # Τυπώνουμε το αποκωδικοποιημένο κειμένο
    echo -e "$decodedText"
}

# Επιλογή ενεργειών με βάση την παράμετρο(-e,-d) εισόδου
while getopts "e:d:" opt; do
    case $opt in
    e)
        encode $OPTARG    # Στέλνουμε το αρχείο $OPTARG(πχ Text.txt) στην συνάρτηση encode
        ;;
    d)
        decode $OPTARG    # Στέλνουμε το αρχείο $OPTARG(πχ Morse_Text.txt) στην συνάρτηση decode
        ;;
    \?)
        echo "That was not the format it was expected"
        ;;
    esac 
done
